omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
/*
 * M66.c
 *
 *  Created on: Aug 30, 2023
 *      Author: atiqueshaikh
 */

#include "M66.h"
#include "stm32f4xx_hal.h"
#include "main.h"
#include <string.h>
#include <stdio.h>
#include "stdbool.h"
#include "stm32f4xx_hal_uart.h"
#include "cJSON.h"
#include <stdint.h>
#include "stm32f4xx_hal_flash.h"
#include "at_commands.h"

char APN[] = "airtelgprs.com";
const uint32_t SHORT_DELAY = 300;   // in milliseconds
const uint32_t DELAY = 10000;  // in milliseconds
const uint32_t LONG_DELAY = 20000;  // in milliseconds

char firmware_url[MAX_URL_LENGTH] = {0};

uint8_t mqtt_buffer[MQTT_BUFFER_SIZE];
size_t mqtt_buffer_idx = 0;

// Firmware buffer
uint8_t firmware_buffer[MAX_FIRMWARE_SIZE];
size_t firmware_size = 0;

volatile bool data_received_flag = false;

uint8_t received_byte; // Temporary storage for received byte
uint8_t receive_buffer[256]; // Circular buffer for received data
size_t buffer_idx = 0; // Current index in buffer
bool firmware_download_complete = false;
bool firmware_download_busy = false;
bool firmware_verify_busy = false;
bool firmware_write_busy = false;
bool read_request = false;


#define UPDATE_FLAG_VALUE 0xDEADBEEF // Arbitrary value to indicate a firmware update is present

UART_BufferTypeDef uart_buffer;
UART_Mode current_mode = MODE_DEFAULT;

unsigned int retry_count = 0;
const uint8_t MAX_RETRIES = 5;

//enum FwUpdateState fwUpdateState;
enum FwUpdateState fwUpdateState = IDLE;

download_state_t current_state = INIT_HTTP;


void Delay(uint32_t milliseconds) {
    // Calculate the number of clock cycles required for the desired delay
    // The actual calculation may vary depending on your microcontroller and clock settings
    uint32_t delay_cycles = milliseconds * (SystemCoreClock / 1000) / 1000;

    // Perform the delay using a simple loop
    for (uint32_t i = 0; i < delay_cycles; i++) {
        // This loop will take some time to execute, creating a delay
        // The exact duration of the delay depends on your microcontroller's clock frequency
        // Adjust the loop count or use a hardware timer for more precise delays
    }
}

//void Initialize_Modem(void)
//{
////	char rxData[100];
////	 do {
////		 HAL_UART_Transmit(&huart2, (uint8_t *)"AT\r\n", strlen("AT\r\n"), 300);
////		 HAL_Delay(300);
////		 HAL_UART_Receive(&huart2, (uint8_t *)rxData, sizeof(100), 300);
////	 }
////	 while(strstr(rxData, "OK") == NULL);
////	 do {
////		 HAL_UART_Transmit(&huart2, (uint8_t *)"AT+CPIN?\r\n", strlen("AT+CPIN?\r\n"), 300);
////		 HAL_Delay(300);
////		 HAL_UART_Receive(&huart2, (uint8_t *)rxData, sizeof(100), 300);
////	 }
////	 while(strstr(rxData, "+CPIN: READY") == NULL);
////	 HAL_Delay(300);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"ATE0\r\n", strlen("ATE0\r\n"), 1000);
//	HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+CPIN?\r\n", strlen("AT+CPIN?\r\n"), 1000);
//	HAL_Delay(3000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+CREG?\r\n", strlen("AT+CREG?\r\n"), 1000);
//	HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QICSGP=1,\"airtelgprs.com\"\r\n", strlen("AT+QICSGP=1,\"airtelgprs.com\"\r\n"), 1000);
////	HAL_UART_Transmit(&huart2, (uint8_t *)',"airtelgprs.com"\r\n', strlen(',"airtelgprs.com"\r\n'), HAL_MAX_DELAY);
//	HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QICSGP?\r\n", strlen("AT+QICSGP?\r\n"), 1000);
//	HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QIREGAPP\r\n", strlen("AT+QIREGAPP\r\n"), 1000);
//	HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QIACT\r\n", strlen("AT+QIACT\r\n"), 1000);
//	HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QILOCIP\r\n", strlen("AT+QILOCIP\r\n"), 1000);
//	HAL_Delay(1000);
//
//}
//Have to work on certificate configuration.
void Initialize_Modem(void)
{
//    at_state = AT_IDLE; // Make sure the state machine is at its initial state
//
//    // Send the initial AT command and check its response
//    send_at_command("AT\r\n", "OK");
//    while (check_at_command_response(1000) == AT_WAITING_RESPONSE);
//
//    if(at_state != AT_RESPONSE_RECEIVED)
//    {
//        return; // If we didn't get an OK, exit
//    }

    // Reset state
    at_state = AT_IDLE;

    // Proceed with other commands using the same pattern
    send_at_command("AT", "OK");
    while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }



    send_at_command("AT+CPIN?", "+CPIN: READY");
    while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }



     send_at_command("AT+CREG?", "+CREG: 0,1");
     while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
     if(at_state != AT_RESPONSE_RECEIVED)
     {
         return;
     }



      send_at_command("AT+QICSGP=1,\"airtelgprs.com\"", "OK");
      while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
      if(at_state != AT_RESPONSE_RECEIVED)
      {
          return;
      }



       send_at_command("AT+QICSGP?", "+QICSGP: 1");
       while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
       if(at_state != AT_RESPONSE_RECEIVED)
       {
           return;
       }



        send_at_command("AT+QIREGAPP", "OK");
        while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
        if(at_state != AT_RESPONSE_RECEIVED)
        {
            return;
        }
//        HAL_Delay(DELAY);


         send_at_command("AT+QIACT", "OK");
         while (check_at_command_response(SHORT_DELAY) == AT_WAITING_RESPONSE);
         if(at_state != AT_RESPONSE_RECEIVED)
         {
             return;
         }
         HAL_Delay(1000);


//         HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QILOCIP\r\n", strlen("AT+QILOCIP\r\n"), 1000);
         UART_Send("AT+QILOCIP\r\n");
         HAL_Delay(1000);




}


void SSL_Config(void){
#ifdef SSLCONFIG
	char CA_CERT[] =  "-----BEGIN CERTIFICATE-----\n\
MIIDQTCCAimgAwIBAgITBmyfz5m/jAo54vB4ikPmljZbyjANBgkqhkiG9w0BAQsF\n\
ADA5MQswCQYDVQQGEwJVUzEPMA0GA1UEChMGQW1hem9uMRkwFwYDVQQDExBBbWF6\n\
b24gUm9vdCBDQSAxMB4XDTE1MDUyNjAwMDAwMFoXDTM4MDExNzAwMDAwMFowOTEL\n\
MAkGA1UEBhMCVVMxDzANBgNVBAoTBkFtYXpvbjEZMBcGA1UEAxMQQW1hem9uIFJv\n\
b3QgQ0EgMTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALJ4gHHKeNXj\n\
ca9HgFB0fW7Y14h29Jlo91ghYPl0hAEvrAIthtOgQ3pOsqTQNroBvo3bSMgHFzZM\n\
9O6II8c+6zf1tRn4SWiw3te5djgdYZ6k/oI2peVKVuRF4fn9tBb6dNqcmzU5L/qw\n\
IFAGbHrQgLKm+a/sRxmPUDgH3KKHOVj4utWp+UhnMJbulHheb4mjUcAwhmahRWa6\n\
VOujw5H5SNz/0egwLX0tdHA114gk957EWW67c4cX8jJGKLhD+rcdqsq08p8kDi1L\n\
93FcXmn/6pUCyziKrlA4b9v7LWIbxcceVOF34GfID5yHI9Y/QCB/IIDEgEw+OyQm\n\
jgSubJrIqg0CAwEAAaNCMEAwDwYDVR0TAQH/BAUwAwEB/zAOBgNVHQ8BAf8EBAMC\n\
AYYwHQYDVR0OBBYEFIQYzIU07LwMlJQuCFmcx7IQTgoIMA0GCSqGSIb3DQEBCwUA\n\
A4IBAQCY8jdaQZChGsV2USggNiMOruYou6r4lK5IpDB/G/wkjUu0yKGX9rbxenDI\n\
U5PMCCjjmCXPI6T53iHTfIUJrU6adTrCC2qJeHZERxhlbI1Bjjt/msv0tadQ1wUs\n\
N+gDS63pYaACbvXy8MWy7Vu33PqUXHeeE6V/Uq2V8viTO96LXFvKWlJbYK8U90vv\n\
o/ufQJVtMVT8QtPHRh8jrdkPSHCa2XV4cdFyQzR1bldZwgJcJmApzyMZFo6IQ6XU\n\
5MsI+yMRQ+hDKXJioaldXgjUkK642M4UwtBV8ob2xJNDd2ZhwLnoQdeXeGADbkpy\n\
rqXRfboQnoZsG4q5WTP468SQvvG5\n\
-----END CERTIFICATE-----\r\n";

