omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
	char Cli_CERT[] = "-----BEGIN CERTIFICATE-----\n\
MIIDWjCCAkKgAwIBAgIVAJucOsrmj0GkIimc5ToFo/rcZCIjMA0GCSqGSIb3DQEB\n\
CwUAME0xSzBJBgNVBAsMQkFtYXpvbiBXZWIgU2VydmljZXMgTz1BbWF6b24uY29t\n\
IEluYy4gTD1TZWF0dGxlIFNUPVdhc2hpbmd0b24gQz1VUzAeFw0yMzA4MjkwODM1\n\
MzlaFw00OTEyMzEyMzU5NTlaMB4xHDAaBgNVBAMME0FXUyBJb1QgQ2VydGlmaWNh\n\
dGUwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDHgFxLbb8kBihIeEUP\n\
p/AKYeyHtFq7NPtpVDRA/5GfybsOaASPFjeE/sVr/II4+XMAQCdOxnlJ1gdtEkjX\n\
j8n0nuNvIfX74QXX5UYVKRjHXuS7sktr5D0pRDcCBg1agPSZp/ohTD3Nr499Yc3b\n\
SdLFA6LFGjFjdNS8EAFQMpp87IEoRXAcV764xklFpw8vOvQS8X85QU+ApTTPIp/F\n\
dpNrpqz+UxO8ydO/edqXXEYdmlJhvHzmIfVevGjwvDJv3N8QKCPhmnIS/Co5leX+\n\
aPDHPx1BCdD1FaKeMErWzecpp1DCjn1PJbp+u3e2vY+72Ym9+Uj29erjkt8U3ifV\n\
0A0JAgMBAAGjYDBeMB8GA1UdIwQYMBaAFPmq0BI0G6csZf8a8H1JiCUZHtGsMB0G\n\
A1UdDgQWBBRIa9gnMDfGriZtNZZD0TjjdsLt8TAMBgNVHRMBAf8EAjAAMA4GA1Ud\n\
DwEB/wQEAwIHgDANBgkqhkiG9w0BAQsFAAOCAQEAmrUdSd5X3uvcdHHWQch3VOUw\n\
MX7D4FW8cjJwJvi1i4rayeQlHAD1m1qiGx1V8KZuGCEK+xdyOaQwC0On03AQUItc\n\
AgNpCFFEbI8gIgEv084JoOUzABglBKFknlzPmadtOD4P8YIM80fvhvG4GWLnvuFa\n\
XVQPXmgLOxe4B1fk7aizrRpUV3aR/MauHhikpQHHUdZnuYaMpMCqJBpVQnAmLBsf\n\
BBavcWnfdVUWWmGSHgzaQ7WGznq9upcNEuGkwZkCZoQOV128+xf1m5S2JNhXrLHf\n\
L3is0Hy/KLSr2jOsgz5qKalAN1JTX1K6WGfRoEHRwT6juhZizkyrkrer87kr5A==\n\
-----END CERTIFICATE-----\r\n";

	char Usr_KEY[] = "-----BEGIN RSA PRIVATE KEY-----\n\
MIIEpQIBAAKCAQEAx4BcS22/JAYoSHhFD6fwCmHsh7RauzT7aVQ0QP+Rn8m7DmgE\n\
jxY3hP7Fa/yCOPlzAEAnTsZ5SdYHbRJI14/J9J7jbyH1++EF1+VGFSkYx17ku7JL\n\
a+Q9KUQ3AgYNWoD0maf6IUw9za+PfWHN20nSxQOixRoxY3TUvBABUDKafOyBKEVw\n\
HFe+uMZJRacPLzr0EvF/OUFPgKU0zyKfxXaTa6as/lMTvMnTv3nal1xGHZpSYbx8\n\
5iH1Xrxo8Lwyb9zfECgj4ZpyEvwqOZXl/mjwxz8dQQnQ9RWinjBK1s3nKadQwo59\n\
TyW6frt3tr2Pu9mJvflI9vXq45LfFN4n1dANCQIDAQABAoIBAQCBIkgblvUzZzzp\n\
89eYE7dfsRT+njJgnSHjgtqz+/mR+W04HQJecB4N2y+E/5R3NphG4D/RUM0viveR\n\
lVVLGsq5qaNDyzLDEFvM7J5Zkhl066qZCAaj1r/0FzCYAbzhCTnKwB07MnOK0QnL\n\
OeSa/gUM+5Z/iL3RR81v0dhXxfmTxAohKrgtkXeP4oxIGVwJKpqBTEsBwOCTLbyT\n\
UlUO1LkWct7ysD4qfk6QmGLNTNY91Nwzaveg56eiHwwmQq82MRwNiB4BB0FrFhM8\n\
pXNvAuJiHW9eOeXU+qEa8rWEIiL8vJu1z95laaasvjNsUAgjI3NOqxXMwtrakOpY\n\
SfkFDNalAoGBAOJ1BXJKrbFkxcRcMMiETHCF9zgCFseqTEGNehbYlomjQSNRneuX\n\
B+r88ABC8crL+mdxZZv5pNQ6uZ+DCxTd8e1FBRyfDQ3PvH/PH8/GAB4h8AY0gqIE\n\
uh7Z18uD2pI4DWXKTUKquDsvRTzU5mcNN4+WMrQ8bFChFNQZuj+J8Y6HAoGBAOGH\n\
GcV2/QFBqvUhVXhosMGZvgslNRn8iJDcDUbR1z7/BHLJmdH/PahKkvT2hgPWwbGq\n\
2rH/lL179Qm9KhjmXCq9UoAffSZCd5yj5VY9fSInTfVoQrmOynsrhduVjVTwQHx6\n\
HnrQaJ7mYSllfFhnZqvICcHHavE99i7kfvhJzlvvAoGBAKe/7cfrH91ve7xoWk6/\n\
Cey0oBwiGAPR1+kbRxxTVrggceka1XOmDlx4/8QB0yDZluU3sAApnnsEAWry5KuR\n\
eVu8q/u2qjHX95dps/PyhTXNCANgtIAWJlUiI+ODCc8UrIABqte+pPhanNxiDUa7\n\
GLRJm8e9lrLnkAlKAZh9s61TAoGAOoH8E5hc5riMi2+MZuJyCKfD/8w1THqRS1Nr\n\
NlY2CyfJlaXre+lFq6U9HsPd3J0YPuleNxNhGQ9RcKdchn0sqAHZp1eD9isEMOTs\n\
GEV3cybTOLlFpjH/IZkW7vKLad+yOxjLU31BxwdpaX3klmKs5h/NODJt8gvrFBs/\n\
PVaYbI0CgYEAkKdmKs/OinXgg+OZZKRP9NDdcAC6tU0z+hcJro5XvgPZyaPLHPZV\n\
EiBeaDGu2GFxU3xMC4Pco1+qoetbHse8Sw5FF4dgWLoPvax2694XQG2nPk4kZ1go\n\
FSFcEE0C9x2LB5Busc2qSAEaxuZOmQ4NJZX40Sh/23Bx5j/uR4nP9eY=\n\
-----END RSA PRIVATE KEY-----\r\n";
#endif

	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QMTCFG=\"SSL\",0,1,2\r\n", strlen("AT+QMTCFG=\"SSL\",0,1,2\r\n"), 1000);
	HAL_Delay(1000);
#ifdef SSLCONFIG
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSECWRITE=\"cacert.pem\",1187,100\r\n", strlen("AT+QSECWRITE=\"cacert.pem\",1187,100\r\n"), 1000);
	HAL_Delay(300);
	HAL_UART_Transmit(&huart2, (uint8_t *)CA_CERT, strlen(CA_CERT), HAL_MAX_DELAY);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", strlen("\r\n"), HAL_MAX_DELAY);
	HAL_Delay(3000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSECWRITE=\"client.pem\",1224,100\r\n", strlen("AT+QSECWRITE=\"client.pem\",1224,100\r\n"), 1000);
	HAL_Delay(300);
	HAL_UART_Transmit(&huart2, (uint8_t *)Cli_CERT, strlen(Cli_CERT), HAL_MAX_DELAY);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", strlen("\r\n"), HAL_MAX_DELAY);
	HAL_Delay(300);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSECWRITE=\"user_key.pem\",1679,100\r\n", strlen("AT+QSECWRITE=\"user_key.pem\",1679,100\r\n"), 1000);
	HAL_Delay(300);
	HAL_UART_Transmit(&huart2, (uint8_t *)Usr_KEY, strlen(Usr_KEY), HAL_MAX_DELAY);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", strlen("\r\n"), HAL_MAX_DELAY);
#endif
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"cacert\",2,\"cacert.pem\"\r\n", strlen("AT+QSSLCFG=\"cacert\",2,\"cacert.pem\"\r\n"), 1000);
	HAL_Delay(1000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"clientcert\",2,\"client.pem\"\r\n", strlen("AT+QSSLCFG=\"clientcert\",2,\"client.pem\"\r\n"), 1000);
	HAL_Delay(1000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"clientkey\",2,\"user_key.pem\"\r\n", strlen("AT+QSSLCFG=\"clientkey\",2,\"user_key.pem\"\r\n"), 1000);
	HAL_Delay(1000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"seclevel\",2,2\r\n", strlen("AT+QSSLCFG=\"seclevel\",2,2\r\n"), 1000);
	HAL_Delay(1000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"sslversion\",2,4\r\n", strlen("AT+QSSLCFG=\"sslversion\",2,4\r\n"), 1000);
	HAL_Delay(1000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"ciphersuite\",2,\"0xFFFF\"\r\n", strlen("AT+QSSLCFG=\"ciphersuite\",2,\"0xFFFF\"\r\n"), 1000);
	HAL_Delay(1000);
	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"ignorertctime\",1\r\n", strlen("AT+QSSLCFG=\"ignorertctime\",1\r\n"), 1000);
	HAL_Delay(1000);

}

const char* mqtt_broker = "a2lrvn2efyqxdn-ats.iot.us-east-1.amazonaws.com";
const char* client_id = "M66";
const char* topic = "$aws/things/M66/shadow";
void AWS_MQTT(void){


//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QMTOPEN=0,\"a2lrvn2efyqxdn-ats.iot.us-east-1.amazonaws.com\",8883\r\n",74 , 1000);
	char mqtt_open_command[128];
	sprintf(mqtt_open_command, "AT+QMTOPEN=0,\"%s\",8883", mqtt_broker);
	send_at_command(mqtt_open_command,"+QMTOPEN: 0,0");
    while (check_at_command_response(LONG_DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }
//	UART_Send(mqtt_open_command);
//	HAL_Delay(LONG_DELAY);
//	send_at_command("AT+QMTOPEN=0,\"%s\",1883\r\n", mqtt_broker);
//	send_at_command("AT+QMTCONN=0,\"%s\"\r\n", client_id);
	char mqtt_conn_command[128];
	sprintf(mqtt_conn_command, "AT+QMTCONN=0,\"%s\"", client_id);
	send_at_command(mqtt_conn_command, "+QMTCONN: 0,0,0");
    while (check_at_command_response(DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }
//    UART_Send(mqtt_conn_command);

    at_state = AT_IDLE;
	char mqtt_sub_command[128];
	sprintf(mqtt_sub_command, "AT+QMTSUB=0,1,\"%s\",1", topic);
	send_at_command(mqtt_sub_command, "+QMTSUB: 0,1,0,1");
    while (check_at_command_response(DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }
//	UART_Send(mqtt_sub_command);
    current_mode = MODE_MQTT;
}


//AT+QMTOPEN=0,"a2lrvn2efyqxdn-ats.iot.us-east-1.amazonaws.com",8883

