omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
        case INITIATE_HTTP_GET:
            send_at_command(firmware_url, "OK");
            send_at_command("AT+QHTTPGET=60", "OK");
            if (check_at_command_response(DELAY) == AT_RESPONSE_RECEIVED) {
                current_state = RECEIVE_HTTP_RESPONSE;
                firmware_download_busy = false;
            } else if (check_at_command_response(LONG_DELAY) == AT_RESPONSE_TIMEOUT) {
                current_state = DOWNLOAD_ERROR;
                firmware_download_busy = false;
            }
            break;


        case RECEIVE_HTTP_RESPONSE:
        	if (!read_request){
        		HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QHTTPREAD=30\r\n", strlen("AT+QHTTPREAD=30\r\n"), 1000);
        		read_request = true;
        	}

            uint8_t receive_buffer[256];
            size_t bytes_received = receive_data(receive_buffer, sizeof(receive_buffer));

            if (bytes_received <= 0) {
                current_state = DOWNLOAD_ERROR;
                firmware_download_busy = false;

            }

            char* end_of_response = strstr((char*)receive_buffer, "\r\nOK\r\n");
            size_t response_length = (end_of_response) ? (end_of_response - (char*)receive_buffer) : bytes_received;

            if (firmware_size + response_length > MAX_FIRMWARE_SIZE) {
                current_state = DOWNLOAD_ERROR;
                firmware_download_busy = false;

            }

            memcpy(firmware_buffer + firmware_size, receive_buffer, response_length);
            firmware_size += response_length;

            if (end_of_response) {
                current_state = DOWNLOAD_COMPLETE;
                firmware_download_busy = false;
                read_request = false;
                result = true; // Indicate completion
            }
            firmware_download_busy = false;
            break;


        case DOWNLOAD_COMPLETE:
            current_state = INIT_HTTP;  // Reset state for next time
            firmware_download_busy = false;
            result = true;
            break;

        case DOWNLOAD_ERROR:
            current_state = INIT_HTTP;  // Reset for next time
            firmware_download_busy = false;
            break;

        default:
            break;
    }
    return result;
}

// Verify firmware update with CRC
bool verify_firmware_update(uint8_t* firmware_data, size_t firmware_length) {
    // Ensure that the firmware data pointer is not NULL and that the length is valid
    if (firmware_data == NULL || !is_firmware_size_valid(firmware_length)) {
    	firmware_verify_busy = false;
        return false;  // Firmware data is invalid
    }

    // Extract the CRC value from the end of the firmware data
    uint32_t received_crc = extract_received_crc(firmware_data, firmware_length);

    // Calculate CRC for the received firmware data (excluding the CRC field)
    uint32_t calculated_crc = calculate_crc32(firmware_data, firmware_length - sizeof(uint32_t));

    // Compare the received and calculated CRC values
    firmware_verify_busy = false;
    return (received_crc == calculated_crc);
}

bool is_firmware_size_valid(size_t firmware_length) {
    return firmware_length > sizeof(uint32_t);  // Ensure firmware_length is more than just the CRC size.
}

uint32_t extract_received_crc(uint8_t* firmware_data, size_t firmware_length) {
    uint32_t* crc_ptr = (uint32_t*)(firmware_data + firmware_length - sizeof(uint32_t));
    return *crc_ptr;
}


// Function to calculate CRC32 for a buffer
uint32_t calculate_crc32(uint8_t *data, uint32_t size) {
    uint32_t crc = 0xFFFFFFFF;

    for (uint32_t i = 0; i < size; i++) {
        crc ^= data[i];

        for (uint32_t j = 0; j < 8; j++) {
            if (crc & 0x00000001) {
                crc = (crc >> 1) ^ CRC_POLYNOMIAL;
            } else {
                crc = crc >> 1;
            }
        }
    }

    return ~crc;
}

bool write_firmware_to_flash(uint8_t* firmware_data, uint32_t firmware_length) {
    // Erase the entire TEMP sector
    HAL_StatusTypeDef status = HAL_FLASH_Unlock();
    if (status != HAL_OK) {
        // Handle flash unlock error
    	firmware_write_busy = false;
        return false;
    }

    FLASH_EraseInitTypeDef erase_info;
    erase_info.TypeErase = FLASH_TYPEERASE_SECTORS;
    erase_info.Sector = FLASH_SECTOR_10; // TEMP sector on STM32F4
    erase_info.NbSectors = 2;
    erase_info.VoltageRange = FLASH_VOLTAGE_RANGE_3; // Adjust voltage range as needed

    uint32_t error_sector;
    status = HAL_FLASHEx_Erase(&erase_info, &error_sector);
    if (status != HAL_OK) {
        // Handle flash erase error
        HAL_FLASH_Lock(); // Lock the flash memory before returning
        firmware_write_busy = false;
        return false;
    }

    // Program the firmware data into flash memory
    uint32_t* flash_address = (uint32_t*)TEMP_START_ADDR;
    uint32_t* firmware_data_ptr = (uint32_t*)firmware_data;

    for (size_t i = 0; i < firmware_length; i += 4) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, (uint32_t)flash_address, *firmware_data_ptr) != HAL_OK) {
            // Handle flash programming error
            HAL_FLASH_Lock(); // Lock the flash memory before returning
            firmware_write_busy = false;
            return false;
        }
        flash_address++;
        firmware_data_ptr++;
    }

    // Set the CONFIG flag after successfully writing firmware
    if (!set_update_flag()) {
        HAL_FLASH_Lock();
        firmware_write_busy = false;
        return false;
    }

    // Lock the flash memory after programming
    HAL_FLASH_Lock();
    firmware_write_busy = false;
    return true; // Return true to indicate success
}

bool set_update_flag(void) {
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, CONFIG_START_ADDR, UPDATE_FLAG_VALUE) != HAL_OK) {
        // Handle flash programming error
        HAL_FLASH_Lock(); // Lock the flash memory before returning
        return false;
    }
    return true;
}


void firmware_update_handler(void)
{
    switch (fwUpdateState)
    {
        case DOWNLOAD_PENDING:
            if (!firmware_download_busy) {
                firmware_download_busy = true; // Set the flag as we're initiating the download
                if (download_firmware(firmware_url)) {
                    fwUpdateState = VERIFY_PENDING;
                    resetAction();
                } else {
                    firmware_download_busy = false; // Reset the flag if download fails
                }
            }
            break;

        case VERIFY_PENDING:
            if (!firmware_verify_busy) {
                firmware_verify_busy = true;
                if (verify_firmware_update(firmware_buffer, firmware_size)) {
                    fwUpdateState = WRITE_PENDING;
                    resetAction();
                } else {
                    firmware_verify_busy = false; // Reset the flag if verification fails
                }
            }
            break;

        case WRITE_PENDING:
            if (!firmware_write_busy) {
                firmware_write_busy = true;
                if (write_firmware_to_flash(firmware_buffer, firmware_size)) {
                    fwUpdateState = RESET_PENDING;
                    resetAction();
                } else {
                    firmware_write_busy = false; // Reset the flag if writing fails
                }
            }
            break;

        case RESET_PENDING:
            NVIC_SystemReset();
            break;

        case ERROR_STATE:
            // Handle error, etc.
            // Reset all flags as we're in an error state
            firmware_download_busy = false;
            firmware_verify_busy = false;
            firmware_write_busy = false;
            break;

        default:
            /* IDLE, ACTION_IN_PROGRESS, or other states. No operation. */
            break;
    }
}

void resetAction() {
    retry_count = 0;
}






